{
  "blogs": [
    {
      "title": "My new website",
      "body": "Sri Lanka (listen); Sinhala: romanized: amil: இலங்கை, romanized: Ilaṅkai (IPA: [ilaŋɡaj])), formerly known as Ceylon and officially the Democratic Socialist Republic of Sri Lanka, is an island country in South Asia. It lies in the Indian Ocean, southwest of the Bay of Bengal, and southeast of the Arabian Sea; it is separated from the Indian subcontinent by the Gulf of Mannar and the Palk Strait. Sri Lanka shares a maritime border with India and the Maldives. Sri Jayawardenepura Kotte is its legislative capital, and Colombo is its largest city and financial centre.Sri Lanka has a population of around 22 million (2020) and is a multinational state, home to diverse cultures, languages, and ethnicities. The Sinhalese are the majority of the nation's population. The Tamils, who are a large minority group, have also played an influential role in the island's history. Other long established groups include the Moors, the Burghers, the Malays, the Chinese, and the indigenous Vedda.Sri Lanka's documented history goes back 3,000 years, with evidence of prehistoric human settlements that dates back at least 125,000 years.[14] The earliest known Buddhist writings of Sri Lanka, known collectively as the Pāli canon, date to the fourth Buddhist council, which took place in 29 BCE.[15][16] Also called the Teardrop of India, or the Granary of the East, Sri Lanka's geographic location and deep harbours have made it of great strategic importance, from the earliest days of the ancient Silk Road trade route to today's so-called maritime Silk Road.[17][18][19] Because its location made it a major trading hub, it was already known to both Far Easterners and Europeans as long ago as the Anuradhapura period (377 BC–1017 AD). During a period of great political crisis in the Kingdom of Kotte, the Portuguese arrived in Sri Lanka and sought to control the island's maritime trade, with a part of Sri Lanka subsequently becoming a Portuguese possession. After the Sinhalese-Portuguese war, the Dutch and the Kingdom of Kandy took control of those areas. The Dutch possessions were then taken by the British, who later extended their control over the whole island, colonising it from 1815 to 1948. A national movement for political independence arose in the early 20th century, and in 1948, Ceylon became a dominion. The dominion was succeeded by the republic named Sri Lanka in 1972. Sri Lanka's more recent history was marred by a 26-year civil war, which began in 1983 and ended decisively in 2009, when the Sri Lanka Armed Forces defeated the Liberation Tigers of Tamil Eelam.[20]Sri Lanka is a developing country, ranking 72nd on the Human Development Index. It is the highest-ranked South Asian nation in terms of development and has the second-highest per capita income in South Asia; however, the ongoing economic crisis has resulted in the collapse of the currency, rising inflation, and a humanitarian crisis due to a severe shortage of essentials. It has also led to an eruption of street protests, with citizens successfully demanding that the president and the government step down.[21] The island has had a long history of engagement with modern international groups: it is a founding member of the SAARC and a member of the United Nations, the Commonwealth of Nations, the G77, and the Non-Aligned Movement.",
      "author": "Herath",
      "id": "1"
    },
    {
      "title": "Welcome party",
      "body": "It is true that optimists, or positive thinkers, are at an advantage in life compared to pessimists. This is because of the effect your mindset and attitude have on everything we come across. Our social relationships, our job and also our health are an integral part of our daily life and we can feel how negative and positive thoughts can have a domino effect on everything we do during the day.The way we choose to think, positive or negative, has a great impact on the final outcome and is mirrored in everything we do. Hence the importance of having a balanced outlook on life.",
      "author": "Upeksha",
      "id": "2"
    },
    {
      "title": "Web dev top tips",
      "body": "Your website’s visual hierarchy describes how you arrange all the website elements your visitors see. It also encompasses each website section’s color, size, and how it looks when paired with other elements on the page. This all works together to highlight some items and make them look more prominent than others. As such, visual hierarchy is how you direct visitor attention to the most important parts of your website.Visual hierarchy is why most websites have a big headline of some sort at the top and small things like a privacy policy statement at the bottom. To better understand how this works, you can break down the concept of visual prominence into five parts. This infographic from Orbit Media further explains the main principles behind visual hierarchy.",
      "author": "Upeksha",
      "id": "3"
    },
    {
      "title": "Importance of Education",
      "body": "djfdfdfd dfodf dfdlf dfoed fefmed foef e dfldf ofe feflefeofeof of dl dlf dofdofdofdofjdf do dof dofdo dof d fdf d fdfodfoeofofodf dofdofjdfdofd d fdoffdofdfdfdfdf dfdfodfdfdfdfdfdofd dfodjfdf df d df dfj dfsd'a'faf dfdfj",
      "author": "Herath",
      "id": "4"
    }
  ]
}